In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import accuracy_score,classification_report,confusion_matrix

In [2]:
data=pd.read_csv('Salary Data.csv')
data.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [5]:
mapping={"Bachelor's":0,"Master's":1,"PhD":2}
data['Education Level']=data['Education Level'].map(mapping)
mapping_gender={'Male':0,'Female':1}
data['Gender']=data['Gender'].map(mapping_gender)

In [7]:
data.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,0.0,0.0,Software Engineer,5.0,90000.0
1,28.0,1.0,1.0,Data Analyst,3.0,65000.0
2,45.0,0.0,2.0,Senior Manager,15.0,150000.0
3,36.0,1.0,0.0,Sales Associate,7.0,60000.0
4,52.0,0.0,1.0,Director,20.0,200000.0

In [9]:
data.isnull().sum()

Age                    2
Gender                 2
Education Level        2
Job Title              2
Years of Experience    2
Salary                 2
dtype: int64

In [11]:
data = data.fillna(0)

In [13]:
data.isnull().sum()

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

In [15]:
data['Job Title'] = data['Job Title'].astype(str)

In [17]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()
data['Job Title'] = le.fit_transform(data['Job Title'])

print(data['Job Title'].head())

0    160
1     18
2    131
3    102
4     23
Name: Job Title, dtype: int32

In [19]:
data.isnull().sum()

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

In [21]:
from sklearn.model_selection import train_test_split
X=data.drop('Salary',axis=1)
y=data['Salary']

In [23]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=0)

In [25]:
print(len(X_train),len(y_train))

300 300

In [27]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  375 non-null    float64
 1   Gender               375 non-null    float64
 2   Education Level      375 non-null    float64
 3   Job Title            375 non-null    int32
 4   Years of Experience  375 non-null    float64
 5   Salary               375 non-null    float64
dtypes: float64(5), int32(1)
memory usage: 16.2 KB

In [29]:
data['Job Title']=data['Job Title'].astype(float)
print(data.dtypes)

Age                    float64
Gender                 float64
Education Level        float64
Job Title              float64
Years of Experience    float64
Salary                 float64
dtype: object

In [44]:
import pickle

In [52]:
X_train.columns

Index(['Age', 'Gender', 'Education Level', 'Job Title', 'Years of Experience'], dtype='object')

In [54]:
data.head()

    Age  Gender  Education Level  Job Title  Years of Experience    Salary
0  32.0     0.0              0.0      160.0                  5.0   90000.0
1  28.0     1.0              1.0       18.0                  3.0   65000.0
2  45.0     0.0              2.0      131.0                 15.0  150000.0
3  36.0     1.0              0.0      102.0                  7.0   60000.0
4  52.0     0.0              1.0       23.0                 20.0  200000.0

In [39]:
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import mean_squared_error,mean_absolute_error,r2_score

In [41]:
model=RandomForestRegressor()
model.fit(X_train,y_train)
y_pred=model.predict(X_test)
mse=mean_squared_error(y_pred,y_test)
mae=mean_absolute_error(y_pred,y_test)
rmse=np.sqrt(mse)
print(mse)
print(mae)
print(rmse)
r2=r2_score(y_pred,y_test)
print("R2 " , r2)

100852494.3106
6939.1973333333335
10042.534257377467
R2  0.9480732061584412

In [49]:
import pickle
with open("Salary_model.pkl","wb")as f:
    pickle.dump(model,f)
print('succesfully created')

succesfully created

In [77]:
data.head()

    Age  Gender  Education Level  Job Title  Years of Experience    Salary
0  32.0     0.0              0.0      160.0                  5.0   90000.0
1  28.0     1.0              1.0       18.0                  3.0   65000.0
2  45.0     0.0              2.0      131.0                 15.0  150000.0
3  36.0     1.0              0.0      102.0                  7.0   60000.0
4  52.0     0.0              1.0       23.0                 20.0  200000.0

In [89]:
da={
    'Age':[30],
    'Gender':[0],
    'Education Level':[1.0],
    'Job Title':[22.0],
    'Years of Experience':[4],
}
df=pd.DataFrame(da)
df.head()

   Age  Gender  Education Level  Job Title  Years of Experience
0   30       0              1.0       22.0                    4

In [93]:
print(model.predict(df[['Age','Gender','Education Level','Job Title','Years of Experience']]))

[62050.]